Tekla Open API Reference for Tekla Structures 2025
InvalidFilterExpressionException.InvalidFilterExpressionExceptionReasonsType Property
 Gets the reason why the exception is thrown.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public InvalidFilterExpressionExceptionReasonsType InvalidFilterExpressionExceptionReasonsType { get; }
Public ReadOnly Property InvalidFilterExpressionExceptionReasonsType As InvalidFilterExpressionExceptionReasonsType
	Get
Property Value
Type: InvalidFilterExpressionExceptionReasonsType
See Also
Reference
InvalidFilterExpressionException Class
Tekla.Structures.Filtering Namespace